MikroElektronika/core_packages/PIC/XC8/def/PIC18F24K50/mcu.h
extern volatile PORTEbits_t PORTEbits __at(0xF84);
// bitfield macros
#define _PORTE_RE3_POSN                                     0x3
#define _PORTE_RE3_POSITION                                 0x3
#define _PORTE_RE3_SIZE                                     0x1
#define _PORTE_RE3_LENGTH                                   0x1
#define _PORTE_RE3_MASK                                     0x8
#define _PORTE_CCP9E_POSN                                   0x3
#define _PORTE_CCP9E_POSITION                               0x3
#define _PORTE_CCP9E_SIZE                                   0x1
#define _PORTE_CCP9E_LENGTH                                 0x1
#define _PORTE_CCP9E_MASK                                   0x8
#define _PORTE_PC3E_POSN                                    0x3
#define _PORTE_PC3E_POSITION                                0x3
#define _PORTE_PC3E_SIZE                                    0x1
#define _PORTE_PC3E_LENGTH                                  0x1
#define _PORTE_PC3E_MASK                                    0x8

// Register: WPUB
#define WPUB WPUB
extern volatile unsigned char           WPUB                __at(0xF85);
#ifndef _LIB_BUILD
asm("WPUB equ 0F85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUB0                  :1;
        unsigned WPUB1                  :1;
        unsigned WPUB2                  :1;
        unsigned WPUB3                  :1;
        unsigned WPUB4                  :1;
        unsigned WPUB5                  :1;
        unsigned WPUB6                  :1;
        unsigned WPUB7                  :1;
    };
} WPUBbits_t;
extern volatile WPUBbits_t WPUBbits __at(0xF85);
// bitfield macros
#define _WPUB_WPUB0_POSN                                    0x0
#define _WPUB_WPUB0_POSITION                                0x0
#define _WPUB_WPUB0_SIZE                                    0x1
#define _WPUB_WPUB0_LENGTH                                  0x1
#define _WPUB_WPUB0_MASK                                    0x1
#define _WPUB_WPUB1_POSN                                    0x1
#define _WPUB_WPUB1_POSITION                                0x1
#define _WPUB_WPUB1_SIZE                                    0x1
#define _WPUB_WPUB1_LENGTH                                  0x1
#define _WPUB_WPUB1_MASK                                    0x2
#define _WPUB_WPUB2_POSN                                    0x2
#define _WPUB_WPUB2_POSITION                                0x2
#define _WPUB_WPUB2_SIZE                                    0x1
#define _WPUB_WPUB2_LENGTH                                  0x1
#define _WPUB_WPUB2_MASK                                    0x4
#define _WPUB_WPUB3_POSN                                    0x3
#define _WPUB_WPUB3_POSITION                                0x3
#define _WPUB_WPUB3_SIZE                                    0x1
#define _WPUB_WPUB3_LENGTH                                  0x1
#define _WPUB_WPUB3_MASK                                    0x8
#define _WPUB_WPUB4_POSN                                    0x4
#define _WPUB_WPUB4_POSITION                                0x4
#define _WPUB_WPUB4_SIZE                                    0x1
#define _WPUB_WPUB4_LENGTH                                  0x1
#define _WPUB_WPUB4_MASK                                    0x10
#define _WPUB_WPUB5_POSN                                    0x5
#define _WPUB_WPUB5_POSITION                                0x5
#define _WPUB_WPUB5_SIZE                                    0x1
#define _WPUB_WPUB5_LENGTH                                  0x1
#define _WPUB_WPUB5_MASK                                    0x20
#define _WPUB_WPUB6_POSN                                    0x6
#define _WPUB_WPUB6_POSITION                                0x6
#define _WPUB_WPUB6_SIZE                                    0x1
#define _WPUB_WPUB6_LENGTH                                  0x1
#define _WPUB_WPUB6_MASK                                    0x40
#define _WPUB_WPUB7_POSN                                    0x7
#define _WPUB_WPUB7_POSITION                                0x7
#define _WPUB_WPUB7_SIZE                                    0x1
#define _WPUB_WPUB7_LENGTH                                  0x1
#define _WPUB_WPUB7_MASK                                    0x80

// Register: IOCB
#define IOCB IOCB
extern volatile unsigned char           IOCB                __at(0xF86);
#ifndef _LIB_BUILD
asm("IOCB equ 0F86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned IOCB4                  :1;
        unsigned IOCB5                  :1;
        unsigned IOCB6                  :1;
        unsigned IOCB7                  :1;
    };
} IOCBbits_t;
extern volatile IOCBbits_t IOCBbits __at(0xF86);
// bitfield macros
#define _IOCB_IOCB4_POSN                                    0x4
#define _IOCB_IOCB4_POSITION                                0x4
#define _IOCB_IOCB4_SIZE                                    0x1
#define _IOCB_IOCB4_LENGTH                                  0x1
#define _IOCB_IOCB4_MASK                                    0x10
#define _IOCB_IOCB5_POSN                                    0x5
#define _IOCB_IOCB5_POSITION                                0x5
#define _IOCB_IOCB5_SIZE                                    0x1
#define _IOCB_IOCB5_LENGTH                                  0x1
#define _IOCB_IOCB5_MASK                                    0x20
#define _IOCB_IOCB6_POSN                                    0x6
#define _IOCB_IOCB6_POSITION                                0x6
#define _IOCB_IOCB6_SIZE                                    0x1
#define _IOCB_IOCB6_LENGTH                                  0x1
#define _IOCB_IOCB6_MASK                                    0x40
#define _IOCB_IOCB7_POSN                                    0x7
#define _IOCB_IOCB7_POSITION                                0x7
#define _IOCB_IOCB7_SIZE                                    0x1
#define _IOCB_IOCB7_LENGTH                                  0x1
#define _IOCB_IOCB7_MASK                                    0x80

// Register: IOCC
#define IOCC IOCC
extern volatile unsigned char           IOCC                __at(0xF87);
#ifndef _LIB_BUILD
asm("IOCC equ 0F87h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCC0                  :1;
        unsigned IOCC1                  :1;
        unsigned IOCC2                  :1;
        unsigned                        :1;
        unsigned IOCC4                  :1;
        unsigned IOCC5                  :1;
        unsigned IOCC6                  :1;
        unsigned IOCC7                  :1;
    };
} IOCCbits_t;
extern volatile IOCCbits_t IOCCbits __at(0xF87);
// bitfield macros
#define _IOCC_IOCC0_POSN                                    0x0
#define _IOCC_IOCC0_POSITION                                0x0
#define _IOCC_IOCC0_SIZE                                    0x1
#define _IOCC_IOCC0_LENGTH                                  0x1
#define _IOCC_IOCC0_MASK                                    0x1
#define _IOCC_IOCC1_POSN                                    0x1
#define _IOCC_IOCC1_POSITION                                0x1
#define _IOCC_IOCC1_SIZE                                    0x1
#define _IOCC_IOCC1_LENGTH                                  0x1
#define _IOCC_IOCC1_MASK                                    0x2
#define _IOCC_IOCC2_POSN                                    0x2
#define _IOCC_IOCC2_POSITION                                0x2
#define _IOCC_IOCC2_SIZE                                    0x1
#define _IOCC_IOCC2_LENGTH                                  0x1
#define _IOCC_IOCC2_MASK                                    0x4
#define _IOCC_IOCC4_POSN                                    0x4
#define _IOCC_IOCC4_POSITION                                0x4
#define _IOCC_IOCC4_SIZE                                    0x1
#define _IOCC_IOCC4_LENGTH                                  0x1
#define _IOCC_IOCC4_MASK                                    0x10
#define _IOCC_IOCC5_POSN                                    0x5
#define _IOCC_IOCC5_POSITION                                0x5
#define _IOCC_IOCC5_SIZE                                    0x1
#define _IOCC_IOCC5_LENGTH                                  0x1
#define _IOCC_IOCC5_MASK                                    0x20
#define _IOCC_IOCC6_POSN                                    0x6
#define _IOCC_IOCC6_POSITION                                0x6
#define _IOCC_IOCC6_SIZE                                    0x1
#define _IOCC_IOCC6_LENGTH                                  0x1
#define _IOCC_IOCC6_MASK                                    0x40
#define _IOCC_IOCC7_POSN                                    0x7
#define _IOCC_IOCC7_POSITION                                0x7
#define _IOCC_IOCC7_SIZE                                    0x1
#define _IOCC_IOCC7_LENGTH                                  0x1
#define _IOCC_IOCC7_MASK                                    0x80

